app/Models/BasicModel.php

    public function getUserProfileEmptyFields($user_id)
    {
        $builder = $this->db->table('user_profiles');
        $builder->select('*'); // Use '*' to select all columns
        $builder->where('user_profiles.user_id', $user_id);
        $userData = $builder->get()->getRow();

        // Debugging: Print the fetched user data
        // print_r($userData);
        if ($userData) {
            $query = $this->db->table('user_profiles')
                ->select([
                    'user_id',
                    'SUM(CASE WHEN name IS NULL OR name = "" THEN 1 ELSE 0 END) AS name_empty',
                    'SUM(CASE WHEN last_name IS NULL OR last_name = "" THEN 1 ELSE 0 END) AS last_name_empty',
                    'SUM(CASE WHEN gender IS NULL OR gender = "" THEN 1 ELSE 0 END) AS gender_empty',
                    'SUM(CASE WHEN email IS NULL OR email = "" THEN 1 ELSE 0 END) AS email_empty',
                    'SUM(CASE WHEN role IS NULL OR role = "" THEN 1 ELSE 0 END) AS role_empty',
                    'SUM(CASE WHEN address IS NULL OR address = "" THEN 1 ELSE 0 END) AS address_empty',
                    'SUM(CASE WHEN pin_code IS NULL THEN 1 ELSE 0 END) AS pin_code_empty',
                    'SUM(CASE WHEN dob IS NULL THEN 1 ELSE 0 END) AS dob_empty',
                    'SUM(CASE WHEN state IS NULL OR state = "" THEN 1 ELSE 0 END) AS state_empty',
                    'SUM(CASE WHEN city IS NULL OR city = "" THEN 1 ELSE 0 END) AS city_empty',
                    'SUM(CASE WHEN country IS NULL OR country = "" THEN 1 ELSE 0 END) AS country_empty'
                ])
                ->where('user_id', $user_id)
                ->get();
---
SELECT *
FROM `user_profiles`
WHERE `user_profiles`.`user_id` = '82'
SELECT `user_id`, SUM(CASE WHEN name IS NULL OR name = "" THEN 1 ELSE 0 END) AS name_empty, SUM(CASE WHEN last_name IS NULL OR last_name = "" THEN 1 ELSE 0 END) AS last_name_empty, SUM(CASE WHEN gender IS NULL OR gender = "" THEN 1 ELSE 0 END) AS gender_empty, SUM(CASE WHEN email IS NULL OR email = "" THEN 1 ELSE 0 END) AS email_empty, SUM(CASE WHEN role IS NULL OR role = "" THEN 1 ELSE 0 END) AS role_empty, SUM(CASE WHEN address IS NULL OR address = "" THEN 1 ELSE 0 END) AS address_empty, SUM(CASE WHEN pin_code IS NULL THEN 1 ELSE 0 END) AS pin_code_empty, SUM(CASE WHEN dob IS NULL THEN 1 ELSE 0 END) AS dob_empty, SUM(CASE WHEN state IS NULL OR state = "" THEN 1 ELSE 0 END) AS state_empty, SUM(CASE WHEN city IS NULL OR city = "" THEN 1 ELSE 0 END) AS city_empty, SUM(CASE WHEN country IS NULL OR country = "" THEN 1 ELSE 0 END) AS country_empty
FROM `user_profiles`
WHERE `user_id` = '82'

    public function getUserEduEmptyFields($user_id)
    {
        $builder = $this->db->table('user_education');
        $builder->select('*'); // Use '*' to select all columns
        $builder->where('user_education.user_id', $user_id);
        $userData = $builder->get()->getRow();
---
SELECT *
FROM `user_education`
WHERE `user_education`.`user_id` = '82'

    public function getUserWorkEmptyFields($user_id)
    {
        $builder = $this->db->table('working_experiences');
        $builder->select('*'); // Use '*' to select all columns
        $builder->where('working_experiences.user_id', $user_id);
        $userData = $builder->get()->getRow();
        //  print_r($userData);
        if ($userData) {
            $query = $this->db->table('working_experiences')
                ->select([
                    'id', // Include the 'id' field
                    'SUM(CASE WHEN organisation IS NULL OR organisation = "" THEN 1 ELSE 0 END) AS organisation_empty',
                    'SUM(CASE WHEN designation IS NULL OR designation = "" THEN 1 ELSE 0 END) AS designation_empty',
                    'SUM(CASE WHEN ref_mobile IS NULL OR ref_mobile = "" THEN 1 ELSE 0 END) AS ref_mobile_empty',
                    'SUM(CASE WHEN ref_email IS NULL OR ref_email = "" THEN 1 ELSE 0 END) AS ref_email_empty',
                    'SUM(CASE WHEN profile IS NULL OR profile = "" THEN 1 ELSE 0 END) AS profile_empty',
                    'SUM(CASE WHEN location IS NULL OR location = "" THEN 1 ELSE 0 END) AS location_empty',
                    'SUM(CASE WHEN start_date IS NULL OR start_date = "" THEN 1 ELSE 0 END) AS start_date_empty',
                    'SUM(CASE WHEN end_date IS NULL OR end_date = "" THEN 1 ELSE 0 END) AS end_date_empty',
                    'SUM(CASE WHEN created_at IS NULL OR created_at = "" THEN 1 ELSE 0 END) AS created_at_empty',
                    'SUM(CASE WHEN updated_at IS NULL OR updated_at = "" THEN 1 ELSE 0 END) AS updated_at_empty'
                ])
                ->where('user_id', $user_id)
                ->get();
---
SELECT *
FROM `working_experiences`
WHERE `working_experiences`.`user_id` = '82'
SELECT `id`, SUM(CASE WHEN organisation IS NULL OR organisation = "" THEN 1 ELSE 0 END) AS organisation_empty, SUM(CASE WHEN designation IS NULL OR designation = "" THEN 1 ELSE 0 END) AS designation_empty, SUM(CASE WHEN ref_mobile IS NULL OR ref_mobile = "" THEN 1 ELSE 0 END) AS ref_mobile_empty, SUM(CASE WHEN ref_email IS NULL OR ref_email = "" THEN 1 ELSE 0 END) AS ref_email_empty, SUM(CASE WHEN profile IS NULL OR profile = "" THEN 1 ELSE 0 END) AS profile_empty, SUM(CASE WHEN location IS NULL OR location = "" THEN 1 ELSE 0 END) AS location_empty, SUM(CASE WHEN start_date IS NULL OR start_date = "" THEN 1 ELSE 0 END) AS start_date_empty, SUM(CASE WHEN end_date IS NULL OR end_date = "" THEN 1 ELSE 0 END) AS end_date_empty, SUM(CASE WHEN created_at IS NULL OR created_at = "" THEN 1 ELSE 0 END) AS created_at_empty, SUM(CASE WHEN updated_at IS NULL OR updated_at = "" THEN 1 ELSE 0 END) AS updated_at_empty
FROM `working_experiences`
WHERE `user_id` = '82'

    public function getUserJobEmptyFields($user_id)
    {
        $builder = $this->db->table('job_pref_user');
        $builder->select('*');
        $builder->where('job_pref_user.user_id', $user_id);
        $userData = $builder->get()->getRow();
---
SELECT *
FROM `job_pref_user`
WHERE `job_pref_user`.`user_id` = '82'

    public function getUserResEmptyFields($user_id)
    {
        $builder = $this->db->table('resumes');
        $builder->select('*'); // Use '*' to select all columns
        $builder->where('resumes.user_id', $user_id);
        $userData = $builder->get()->getRow();
        //  print_r($userData);
        if ($userData) {
            $query = $this->db->table('resumes')
                ->select([
                    'id', // Include the 'id' field
                    'SUM(CASE WHEN Resume IS NULL OR Resume = "" THEN 1 ELSE 0 END) AS Resume_empty',
                    'SUM(CASE WHEN created_at IS NULL OR created_at = "" THEN 1 ELSE 0 END) AS created_at_empty'
                ])
                ->where('user_id', $user_id)
                ->get();
---
SELECT *
FROM `resumes`
WHERE `resumes`.`user_id` = '82'
SELECT `id`, SUM(CASE WHEN Resume IS NULL OR Resume = "" THEN 1 ELSE 0 END) AS Resume_empty, SUM(CASE WHEN created_at IS NULL OR created_at = "" THEN 1 ELSE 0 END) AS created_at_empty
FROM `resumes`
WHERE `user_id` = '82'

    public function getUserImgEmptyFields($user_id)
    {
        $builder = $this->db->table('user_profile_images');
        $builder->select('*'); // Use '*' to select all columns
        $builder->where('user_profile_images.user_id', $user_id);
        $userData = $builder->get()->getRow();
---
SELECT *
FROM `user_profile_images`
WHERE `user_profile_images`.`user_id` = '82'