app/Models/JobApplyModel.php

SELECT `job_listings`.*, `hoteliers`.*, `job_applications`.*
FROM `job_listings`
JOIN `hoteliers` ON `hoteliers`.`user_id` = `job_listings`.`hotelier_id`
LEFT JOIN `job_applications` ON `job_applications`.`job_id` = `job_listings`.`id`
WHERE `job_applications`.`user_id` = '82'
---
    public function getJobData($userId)
    {
        $builder = $this->db->table('job_listings');

        // Select the fields from job_listings, hoteliers, and job_applications tables
        $builder->select('job_listings.*, hoteliers.*, job_applications.*');

        // Join the hoteliers table
        $builder->join('hoteliers', 'hoteliers.user_id = job_listings.hotelier_id');

        // Join the job_applications table
        $builder->join('job_applications', 'job_applications.job_id = job_listings.id', 'left');

        // Filter by job_applications.user_id
        $builder->where('job_applications.user_id', $userId);
        // Execute the query
        $query = $builder->get();