app/Models/JobModel.php

SELECT `job_listings`.*, `hoteliers`.*
FROM `job_listings`
JOIN `hoteliers` ON `hoteliers`.`user_id` = `job_listings`.`hotelier_id`
---
    public function getallJobData()
    {
        $builder = $this->db->table('job_listings');
        $builder->select('job_listings.*, hoteliers.name,hoteliers.address,hoteliers.city,hoteliers.state,hoteliers.pin_code,hoteliers.address');
        $builder->join('hoteliers', 'hoteliers.user_id = job_listings.hotelier_id');

        $query = $builder->get();