app/Models/UserModel.php

SELECT `working_experiences`.*
FROM `working_experiences`
WHERE `working_experiences`.`user_id` = '10'
---
    public function getby_id_data($userId)
    {

        // Create a query builder instance for the user_log table
        $builder = $this->db->table('working_experiences');

        // Set the SELECT clause to select all fields from the user_log table
        $builder->select('working_experiences.*');
        $builder->where('working_experiences.user_id', $userId);
        // Execute the query and retrieve the results
        $query = $builder->get();

SELECT `users`.*, `user_profiles`.*
FROM `users`
JOIN `user_profiles` ON `user_profiles`.`user_id` = `users`.`id`
---
    public function getUserData($userId)
    {

        $builder = $this->db->table('user_profiles');
        $builder->select(' user_profiles.*');

        $builder->where('user_profiles.user_id', $userId);
        $query = $builder->get();

SELECT `users`.*, `user_profiles`.*
FROM `users`
JOIN `user_profiles` ON `user_profiles`.`user_id` = `users`.`id`
---
    public function getUserHData($userId)
    {

        $builder = $this->db->table('hoteliers');
        $builder->select(' hoteliers.*');

        $builder->where('hoteliers.user_id', $userId);
        $query = $builder->get();

SELECT `user_education`.*
FROM `user_education`
WHERE `user_education`.`user_id` = '10'
---
    public function getUserEd_id($userId)
    {

        $builder = $this->db->table('user_education');
        $builder->select('user_education.*');

        $builder->where('user_education.user_id', $userId);
        $query = $builder->get();